'''
while문을 이용하여 달러($), 원화(원), 유로(€)의 환산표를 만드는 프로그램을 작성해 보세요.
$1 당 환율 : 1080원(원화), 0.81 € (유로)
Copy
실행 결과

--------------------------------------------------


 달러($)  원화(원)  유로(€)
--------------------------------------------------

     10    10800     8.1
     20    21600    16.2
     30    32400    24.3
    ...
     90    97200    72.9

    100   108000    81.0
--------------------------------------------------
'''

# 연습문제4-9
print('-' * 50)
print(' 달러($)  원화(원)  유로(€)')
print('-' * 50)
dollar = 10

while dollar < 11:
    for i in range(1,11):

        won = dollar * 108 * i
        euro = dollar * 0.81 * i
        dollar = dollar * i

        print('%7d %8.0f %7.1f' % (dollar, won, euro))


print('-' * 50)